<a href="https://colab.research.google.com/github/JoyDantas/Estudos_Colab/blob/main/Consolidando_tabelas_sheets.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
## importando pacotes

import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt

In [2]:
#autenticando gspread 

from google.colab import auth
auth.authenticate_user()

import gspread
from oauth2client.client import GoogleCredentials

In [3]:
gc = gspread.authorize(GoogleCredentials.get_application_default())

In [25]:
# abrindo a planilha
worksheetbr = gc.open("notas_teste")

In [26]:
dia_1 = worksheetbr.sheet1

In [27]:
dia_1.col_values(3)

['notas', '8.5', '5', '3', '2.6', '7', '6', '6']

In [28]:
df= pd.DataFrame(dia_1.get_all_records())

In [29]:
df.head

<bound method NDFrame.head of    dia     alunos  notas
0    1       joão    8.5
1    1        ana    5.0
2    1      maria    3.0
3    1      carol    2.6
4    1      julia    7.0
5    1  fernando     6.0
6    1      pedro    6.0>

In [30]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   dia     7 non-null      int64
 1   alunos  7 non-null      object
 2   notas   7 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 296.0+ bytes
None

In [31]:
df['notas'] = pd.to_numeric(df['notas'])

In [32]:
dia_1 = df

In [35]:
dia_2 = worksheetbr.worksheet('dia 2')

In [37]:
aba_2 = dia_2.get_all_records()

In [38]:
df = pd.DataFrame(aba_2)

In [40]:
df.head()

   dia alunos  notas
0    2   joão     10
1    2    ana      5
2    2  maria      2
3    2  carol      6
4    2  julia      7

In [41]:
dia_2 = df

In [42]:
dia_2['notas'] = pd.to_numeric(df['notas'])

In [43]:
## concatenando dataframes

concat_frames = [dia_1, dia_2]

In [45]:
##novo dataframe com os dados concatenados 

df_full = pd.concat(concat_frames)

In [48]:
df_full.head(14)

   dia     alunos  notas
0    1       joão    8.5
1    1        ana    5.0
2    1      maria    3.0
3    1      carol    2.6
4    1      julia    7.0
5    1  fernando     6.0
6    1      pedro    6.0
0    2       joão   10.0
1    2        ana    5.0
2    2      maria    2.0
3    2      carol    6.0
4    2      julia    7.0
5    2  fernando     8.0
6    2      pedro    8.0

In [47]:
df_full.shape

(14, 3)